{
  "format": "layers-model",
  "generatedBy": "keras 2.15.0 / custom converter",
  "convertedBy": "scripts/convert-keras-to-tfjs.py",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              48,
              48,
              1
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_1"
          },
          "registered_name": null
        },
        {
          "module": "keras.layers",
          "class_name": "RandomFlip",
          "config": {
            "name": "random_flip",
            "trainable": true,
            "dtype": "float32",
            "mode": "horizontal",
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              1
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "RandomRotation",
          "config": {
            "name": "random_rotation",
            "trainable": true,
            "dtype": "float32",
            "factor": 0.08,
            "fill_mode": "reflect",
            "fill_value": 0.0,
            "interpolation": "bilinear",
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              1
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "RandomZoom",
          "config": {
            "name": "random_zoom",
            "trainable": true,
            "dtype": "float32",
            "height_factor": [
              -0.1,
              0.1
            ],
            "width_factor": null,
            "fill_mode": "reflect",
            "fill_value": 0.0,
            "interpolation": "bilinear",
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              1
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              1
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              3
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              48,
              48,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.15,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_1",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              3
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              24,
              24,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_2",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_2",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              3
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_2",
            "trainable": true,
            "dtype": "float32",
            "pool_size": [
              2,
              2
            ],
            "padding": "valid",
            "strides": [
              2,
              2
            ],
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              12,
              12,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.25,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              6,
              6,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              6,
              6,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              4608
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.35,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 7,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          }
        }
      ]
    },
    "keras_version": "keras 2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv2d/kernel:0",
          "shape": [
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d/bias:0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/gamma:0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta:0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean:0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance:0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/kernel:0",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel:0",
          "shape": [
            3,
            3,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias:0",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma:0",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta:0",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean:0",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance:0",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel:0",
          "shape": [
            4608,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias:0",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel:0",
          "shape": [
            128,
            7
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias:0",
          "shape": [
            7
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}